Торговля_11__демо/src/InformationRegisters/ОграниченияВыгрузкиОстатковМаркетплейсов/ОграниченияВыгрузкиОстатковМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОграниченияВыгрузкиОстатковМаркетплейсов</name>
  <resources>
    <name>ПроцентОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтраховойЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПредставлениеОграничения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>УчетнаяЗаписьМаркетплейса</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбластьДействия</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Торговля_11__демо/src/InformationRegisters/ОграниченияВыгрузкиОстатковМаркетплейсов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(УчетнаяЗаписьМаркетплейса.Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьПредставлениеЗаписи(Запись) Экспорт

	ОграничениеОтключено = НСтр("ru = 'Ограничение выгрузки остатков не установлено'");
	ТекстОграничения1 = НСтр("ru = 'Остаток недоступен к выгрузке'");
	ТекстОграничения2 = НСтр("ru = 'К выгрузке доступно %1 % от учетного количества остатка номенклатуры'");
	ТекстОграничения3 = НСтр("ru = 'Из выгружаемого остатка номенклатуры исключается страховой запас в количестве %1'");
	ТекстОграничения4 = НСтр("ru = 'К выгрузке доступно %1 % от учетного количества остатка номенклатуры, но с обеспечением страхового запаса в количестве %2 остатка номенклатуры'");

	Если Не Запись.Используется Тогда
		ПредставлениеОграничения = ОграничениеОтключено;
	ИначеЕсли Запись.ПроцентОстатка = 100 И ЗначениеЗаполнено(Запись.СтраховойЗапас) Тогда
		СклоненноеЧисло = ПолучитьСклоненияСтрокиПоЧислу(НСтр("ru = 'единица'"), Запись.СтраховойЗапас,,, "ПД=Родительный; ПЧ=ЧислоСОкончанием");
		ПредставлениеОграничения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОграничения3, СклоненноеЧисло[0]);
	ИначеЕсли ЗначениеЗаполнено(Запись.ПроцентОстатка) И ЗначениеЗаполнено(Запись.СтраховойЗапас) Тогда
		СклоненноеЧисло = ПолучитьСклоненияСтрокиПоЧислу(НСтр("ru = 'единица'"), Запись.СтраховойЗапас,,, "ПД=Родительный; ПЧ=ЧислоСОкончанием");
		ПредставлениеОграничения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОграничения4, Запись.ПроцентОстатка, СклоненноеЧисло[0]);
	ИначеЕсли ЗначениеЗаполнено(Запись.ПроцентОстатка) Тогда
		ПредставлениеОграничения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОграничения2, Запись.ПроцентОстатка);
	Иначе
		ПредставлениеОграничения = ТекстОграничения1;
	КонецЕсли;

	Запись.ПредставлениеОграничения = ПредставлениеОграничения;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
